tutorials/featureCases/1D_pipingNetwork/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type                    fixedValue;
        value                   uniform 300;
    }
    outlet
    {
        type                    zeroGradient;
    }
    pipeWall
    {
        type                    zeroGradient;
    }

    ".*"
    {
        type                    discontinuousCyclicAMI;
        patchType               discontinuousCyclicAMI;
    }

}


// ************************************************************************* //
