tutorials/featureCases/1D_pipingNetwork/0/fluid/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField::Internal;
    location    "0/fluid";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

value           nonuniform List<scalar> 
2208
(
0.0654498
0.0654498
0.0654498
0.0654498
0.0654498
0.0654498
0.0654498
0.0654498
...
)
;


// ************************************************************************* //
