tutorials/featureCases/1D_pipingNetwork/Allrun
#!/bin/sh
#----------------------------------------------------------------------------#
#       ______          _   __           ______                              #
#      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___    #
#     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \   #
#    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /   #
#    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/   #
#    Copyright (C) 2015 - 2022 EPFL                                          #
#----------------------------------------------------------------------------#

cd "${0%/*}" || exit 1    # Run from this directory

#==============================================================================*

# Source OpenFOAM run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

#==============================================================================*
# 1) Generate blockMeshDict using Python
echo "Generating blockMeshDict with mesh.py"
python3 mesh.py || exit 1

#==============================================================================*
# 2) Run blockMesh for the fluid region
echo "Running blockMesh for fluid region"
blockMesh -region fluid | tee log.blockMesh || exit 1

#==============================================================================*
# 3) Run GeN-Foam and save log
echo "Running GeN-Foam"
GeN-Foam | tee log.GeN-Foam

#==============================================================================*
