tutorials/featureCases/1D_pipingNetwork/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

35
(
    pipeWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8832;
        startFace       2193;
    }
    pipe1topipe2_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11025;
        neighbourPatch  pipe2_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 10 0 1 );
        matchTolerance  0.1;
        faces           ( ( v4 v5 v6 v7 ) );
    }
    pipe2_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11026;
        neighbourPatch  pipe1topipe2_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 10 0 1 );
        matchTolerance  0.1;
        faces           ( ( v8 v11 v10 v9 ) );
    }
    pipe2_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11027;
        neighbourPatch  pipe3_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 12 0 11 );
        matchTolerance  0.1;
        faces           ( ( v12 v13 v14 v15 ) );
    }
    pipe3_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11028;
        neighbourPatch  pipe2_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 12 0 11 );
        matchTolerance  0.1;
        faces           ( ( v16 v19 v18 v17 ) );
    }
    pipe3topipe4_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11029;
        neighbourPatch  pipe4_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 22 0 13 );
        matchTolerance  0.1;
        faces           ( ( v20 v21 v22 v23 ) );
    }
    pipe4_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11030;
        neighbourPatch  pipe3topipe4_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 22 0 13 );
        matchTolerance  0.1;
        faces           ( ( v24 v27 v26 v25 ) );
    }
    pipe4_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11031;
        neighbourPatch  pipe5_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 24 0 18 );
        matchTolerance  0.1;
        faces           ( ( v28 v29 v30 v31 ) );
    }
    pipe5_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11032;
        neighbourPatch  pipe4_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 24 0 18 );
        matchTolerance  0.1;
        faces           ( ( v32 v35 v34 v33 ) );
    }
    pipe3topipe6_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11033;
        neighbourPatch  pipe6_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 22 0 11 );
        matchTolerance  0.1;
        faces           ( ( v20 v21 v22 v23 ) );
    }
    pipe6_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11034;
        neighbourPatch  pipe3topipe6_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 22 0 11 );
        matchTolerance  0.1;
        faces           ( ( v40 v43 v42 v41 ) );
    }
    pipe6_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11035;
        neighbourPatch  pipe7_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 24 0 6 );
        matchTolerance  0.1;
        faces           ( ( v44 v45 v46 v47 ) );
    }
    pipe7_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11036;
        neighbourPatch  pipe6_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 24 0 6 );
        matchTolerance  0.1;
        faces           ( ( v48 v51 v50 v49 ) );
    }
    pipe5_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11037;
        neighbourPatch  pipe8_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 44 0 18 );
        matchTolerance  0.1;
        faces           ( ( v36 v37 v38 v39 ) );
    }
    pipe8_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11038;
        neighbourPatch  pipe5_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 44 0 18 );
        matchTolerance  0.1;
        faces           ( ( v56 v59 v58 v57 ) );
    }
    pipe7_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11039;
        neighbourPatch  pipe9_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 44 0 6 );
        matchTolerance  0.1;
        faces           ( ( v52 v53 v54 v55 ) );
    }
    pipe9_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11040;
        neighbourPatch  pipe7_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 44 0 6 );
        matchTolerance  0.1;
        faces           ( ( v64 v67 v66 v65 ) );
    }
    pipe8_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11041;
        neighbourPatch  pipe10frompipe8_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 46 0 13 );
        matchTolerance  0.1;
        faces           ( ( v60 v61 v62 v63 ) );
    }
    pipe10frompipe8_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11042;
        neighbourPatch  pipe8_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 46 0 13 );
        matchTolerance  0.1;
        faces           ( ( v72 v75 v74 v73 ) );
    }
    pipe9_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11043;
        neighbourPatch  pipe10frompipe9_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 46 0 11 );
        matchTolerance  0.1;
        faces           ( ( v68 v69 v70 v71 ) );
    }
    pipe10frompipe9_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11044;
        neighbourPatch  pipe9_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 46 0 11 );
        matchTolerance  0.1;
        faces           ( ( v72 v75 v74 v73 ) );
    }
    pipe10_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11045;
        neighbourPatch  pipe11_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 56 0 11 );
        matchTolerance  0.1;
        faces           ( ( v76 v77 v78 v79 ) );
    }
    pipe11_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11046;
        neighbourPatch  pipe10_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 56 0 11 );
        matchTolerance  0.1;
        faces           ( ( v80 v83 v82 v81 ) );
    }
    pipe1topipe12_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11047;
        neighbourPatch  pipe12_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 10 0 -1 );
        matchTolerance  0.1;
        faces           ( ( v4 v5 v6 v7 ) );
    }
    pipe12_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11048;
        neighbourPatch  pipe1topipe12_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 10 0 -1 );
        matchTolerance  0.1;
        faces           ( ( v88 v91 v90 v89 ) );
    }
    pipe12_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11049;
        neighbourPatch  pipe13_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 12 0 -11 );
        matchTolerance  0.1;
        faces           ( ( v92 v93 v94 v95 ) );
    }
    pipe13_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11050;
        neighbourPatch  pipe12_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 12 0 -11 );
        matchTolerance  0.1;
        faces           ( ( v96 v99 v98 v97 ) );
    }
    pipe13_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11051;
        neighbourPatch  pipe14_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 56 0 -11 );
        matchTolerance  0.1;
        faces           ( ( v100 v101 v102 v103 ) );
    }
    pipe14_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11052;
        neighbourPatch  pipe13_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 56 0 -11 );
        matchTolerance  0.1;
        faces           ( ( v104 v107 v106 v105 ) );
    }
    pipe14_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11053;
        neighbourPatch  pipe15frompipe14_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 58 0 -1 );
        matchTolerance  0.1;
        faces           ( ( v108 v109 v110 v111 ) );
    }
    pipe15frompipe14_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11054;
        neighbourPatch  pipe14_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 58 0 -1 );
        matchTolerance  0.1;
        faces           ( ( v112 v115 v114 v113 ) );
    }
    pipe11_outletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11055;
        neighbourPatch  pipe15frompipe11_inletAMI;
        transform       rotational;
        rotationAxis    ( 0 1 0 );
        rotationCentre  ( 58 0 1 );
        matchTolerance  0.1;
        faces           ( ( v84 v85 v86 v87 ) );
    }
    pipe15frompipe11_inletAMI
    {
        type            discontinuousCyclicAMI;
        nFaces          1;
        startFace       11056;
        neighbourPatch  pipe11_outletAMI;
        transform       rotational;
        rotationAxis    ( 0 -1 0 );
        rotationCentre  ( 58 0 1 );
        matchTolerance  0.1;
        faces           ( ( v112 v115 v114 v113 ) );
    }
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       11057;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       11058;
    }
)

// ************************************************************************* //
